package homeWorks.secondWeek.homework_04_03_2024;

/**
 *  1 уровень сложности: Задание 1
 * Создайте класс Concatenation
 * Создайте две переменные типа String
 * Примените конкатенацию строк и выведите результат в консоль.
 * Скомпилируйте созданную программу.
 * Запустите программу в терминале.
 */
public class Continental {
    public static void main(String[] args) {
        String firstValue = "valueOne";
        String secondValue = "valueTwo";
        System.out.println(firstValue + secondValue);
    }
}
