package fourtheeWeek.lesson_19_03_2024;

/**
 * Реализовать простую лотерею, используя конструкцию if-else-if:
 * Создать класс для лотереи
 * В методе main() реализовать лотерею
 * Добавить переменные для выигрышных номеров (5 номеров)
 * Добавить переменные для номеров пользователя
 * Получить от пользователя 5 номеров, используем Сканер
 * Ограничить игровые номера от 1 до 50
 * Рандомально присвоить в переменные выигрышные номера
 * Распечатать на консоль номера лотереи и номера введенные пользователем
 */
public class LotteryDemo {
    public static void main(String[] args) {
        ResultOfLottery resultOfLottery = new ResultOfLottery();
        resultOfLottery.finalResultOfLottery();





    }
}
